Конфигурация/Documents/ИзменениеУсловийСделки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ИзменениеУсловийСделки</Name>
			<BasedOn>
				<xr:Item>Document.Сделка</xr:Item>
				<xr:Item>Document.СделкаРЕПО</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумагКПолучению</xr:Item>
				<xr:Item>InformationRegister.УсловияСделокРЕПО</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>InformationRegister.УсловияСделок</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ОперацииСЦеннымиБумагами</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумагКупленныеПоРЕПО</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоЦеннымБумагам</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоВторойЧастиРЕПО</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СделкаРЕПО</v8:Type>
						<v8:Type>cfg:DocumentRef.Сделка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВторойЧастиРЕПО</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобственныйКурсОплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>20</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратныйКупонКЗачету</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаЗадолженностиПоКупону</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗаймаКПогашениюВВалютеСделки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежноеУсловиеСделки</Name>
					<Comment>Для внебиржевых сделок</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаРЕПО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦенныеБумаги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исполнено</Name>
							<Comment>Исполнено в части поставки</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДепозитарныйСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПроцент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаПроцент</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаКупона</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКупона</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/InformationRegisters/УсловияСделокРЕПО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УсловияСделокРЕПО</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отменено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДепозитарныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВторойЧастиРЕПО</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СобственныйКурсОплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КурсОплаты</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КурсОплаты</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаПроцент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаПроцент</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлатежноеУсловиеСделки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаРЕПО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Comment>Заполняется автоматически на основании части РЕПО</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтложенноеИсполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаздельноеИсполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СделкаРЕПО</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СделкаРЕПО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧастьСделкиРЕПО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Documents/ИзменениеУсловийСделки/Ext/ManagerModule.bsl
Процедура УточнитьТекстЗапросаКУсловиямСделки(ТекстЗапроса, Основание) Экспорт
	
	ТипОснования = ТипЗнч(Основание);
	
	Если      ТипОснования = Тип("ДокументСсылка.Сделка") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СделкаРЕПО", "Сделка");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "УсловияСделокРЕПО", "УсловияСделок");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &ОтборПоВидуЗадолженности", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДатаВторойЧастиРЕПО КАК ДатаВторойЧастиРЕПО,", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СтавкаРЕПО КАК СтавкаРЕПО,", "");
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.СделкаРЕПО") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &ОтборПоВидуЗадолженности", "И ВидЗадолженности = &ВидЗадолженности");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДатаВторойЧастиРЕПО КАК ДатаВторойЧастиРЕПО,", "УсловияСделокСрезПоследних.ДатаВторойЧастиРЕПО КАК ДатаВторойЧастиРЕПО,");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СтавкаРЕПО КАК СтавкаРЕПО,", "УсловияСделокСрезПоследних.СтавкаРЕПО КАК СтавкаРЕПО,");
	КонецЕсли;
	
КонецПроцедуры // УточнитьТекстЗапросаКУсловиямСделки

Функция ПолучитьУсловияСделки(Период, Основание, ВидЗадолженности) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УсловияСделокСрезПоследних.ЦеннаяБумага КАК ЦеннаяБумага,
		|	УсловияСделокСрезПоследних.ДепозитарныйСчет КАК ДепозитарныйСчет,
		|	&ДатаВторойЧастиРЕПО КАК ДатаВторойЧастиРЕПО,
		|	&СтавкаРЕПО КАК СтавкаРЕПО,
		|	УсловияСделокСрезПоследних.ДатаИсполнения КАК ДатаИсполнения,
		|	УсловияСделокСрезПоследних.ДатаОплаты КАК ДатаОплаты,
		|	УсловияСделокСрезПоследних.ДатаПоставки КАК ДатаПоставки,
		|	УсловияСделокСрезПоследних.ВалютаОплаты КАК ВалютаОплаты,
		|	УсловияСделокСрезПоследних.СобственныйКурсОплаты КАК СобственныйКурсОплаты,
		|	УсловияСделокСрезПоследних.КурсОплаты КАК КурсОплаты,
		|	УсловияСделокСрезПоследних.Количество КАК Количество,
		|	УсловияСделокСрезПоследних.Цена КАК Цена,
		|	УсловияСделокСрезПоследних.ЦенаПроцент КАК ЦенаПроцент,
		|	УсловияСделокСрезПоследних.ЦенаКупона КАК ЦенаКупона,
		|	УсловияСделокСрезПоследних.Сумма КАК Сумма,
		|	УсловияСделокСрезПоследних.СуммаКупона КАК СуммаКупона,
		|	УсловияСделокСрезПоследних.ПлатежноеУсловиеСделки КАК ПлатежноеУсловиеСделки
		|ИЗ
		|	РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|			&Период,
		|			НЕ Отменено
		|				И СделкаРЕПО = &Сделка
		|				И &ОтборПоВидуЗадолженности) КАК УсловияСделокСрезПоследних";
		
	УточнитьТекстЗапросаКУсловиямСделки(Запрос.Текст, Основание);

	Запрос.УстановитьПараметр("Период",           Новый Граница(Период, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ВидЗадолженности", ВидЗадолженности);
	Запрос.УстановитьПараметр("Сделка",           ?(ТипЗнч(Основание) = тип("ДокументСсылка.СделкаРЕПО") И Основание.ЧастьСделкиРЕПО = 2, Основание.ПерваяЧастьРЕПО, Основание));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьУсловияСделки
